cask "firefox"
cask "spotify"
cask '1password'
cask 'slack'
cask 'microsoft-teams'
cask 'discord'
cask 'iterm2'
cask "visual-studio-code"
cask 'rectangle'

brew 'romkatv/powerlevel10k/powerlevel10k'

brew 'curl'
brew 'wget'
brew 'vim'
brew 'bat'
brew 'exa'
brew 'jq'
brew 'yq'
brew 'httpie'
brew 'docker'
brew 'chezmoi'

brew "awscli"

brew 'pyenv'
brew "python"
brew "pipenv"
brew "pre-commit"
brew "go"
brew "rust"
brew "node"
